controltheory/beamer/6/6_3_lag.org
# +LaTeX_CLASS:  article
#+LATEX_HEADER: \usepackage{etex}
#+LATEX_HEADER: \usepackage{amsmath}
 # +LATEX_HEADER: \usepackage[usenames]{color}
#+LATEX_HEADER: \usepackage{pstricks}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \pgfplotsset{compat=1.8}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage[europeanresistors,americaninductors]{circuitikz}
#+LATEX_HEADER: \usepackage{colortbl}
#+LATEX_HEADER: \usepackage{yfonts}
#+LATEX_HEADER: \usetikzlibrary{shapes,arrows}
#+LATEX_HEADER: \usetikzlibrary{positioning}
#+LATEX_HEADER: \usetikzlibrary{arrows,shapes}
#+LATEX_HEADER: \usetikzlibrary{intersections}
#+LATEX_HEADER: \usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
#+LATEX_HEADER: \usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
#+LATEX_HEADER: \setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
#+LATEX_HEADER: \setCJKmonofont{Evermore Kai}
 # +LATEX_HEADER: \xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
#+LATEX_HEADER: \usepackage{pst-node}
#+LATEX_HEADER: \usepackage{pst-plot}
#+LATEX_HEADER: \psset{unit=5mm}


#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [table]
# +LaTeX_CLASS_OPTIONS: [bigger]
 # +latex_header:  \mode<article>{\usepackage{beamerarticle}}
# +latex_header: \mode<beamer>{\usetheme{JuanLesPins}}
# +latex_header: \mode<beamer>{\usetheme{Boadilla}}
#+latex_header: \mode<beamer>{\usetheme{Frankfurt}}
#+latex_header: \mode<beamer>{\usecolortheme{dove}}
#+latex_header: \mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
#+latex_header: \mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
#+latex_header: \setbeamercovered{transparent}
#+BEAMER_FRAME_LEVEL: 2
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+TITLE:  线性系统校正方法
#+latex_header: \subtitle{串联滞后校正}
#+AUTHOR:    
#+EMAIL: 
#+DATE:  
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:










* 串联滞后校正原理与方法
** 串联滞后校正原理
利用滞后网絡的幅值衰减特性,使校正后的 $\omega_c$ 前移,从而达到提升 $\gamma$ 的目的.
\begin{eqnarray*}
G_c(s) & = &\frac{1+bTs}{1+Ts} 
\end{eqnarray*}
其中:$b<1$ 

*** 校正网络Bode图					      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :BEAMER_envargs: <2->
     :END:
\begin{tikzpicture}[scale=0.7]
\draw[->] (-1,0) -- (3.5,0);
\draw[->] (0,-1.1) -- (0,0.5);
\draw (0,0.5) node[above left] {$L_c(\omega)$};
\draw [red,thick] plot coordinates {(0,0) (1,0) (2,-1)  (3,-1)};
\draw (1,0) node[above] {$\frac{1}{T}$};
\draw (2,0) node[above] {$\frac{1}{bT}$};
\draw[dashed,pink] (1.5,0) -- + (0,-1);

\begin{scope}[shift={(0,-3)}]
\draw[->] (-1,0) -- (3.5,0);
\draw[->] (0,-1.1) -- (0,0.5);
\draw (0,0.5) node[above left] {$\phi_c(\omega)$};
\draw [red,thick] plot [smooth] coordinates {(0,0) (0.5,-0.1) (1,-0.45) (1.5,-1) (2,-0.45) (2.5,-0.1) (3,0)};
\draw (1,0) node[above] {$\frac{1}{T}$};
\draw (2,0) node[above] {$\frac{1}{bT}$};
\draw[dashed,pink] (1.5,0) -- +(0,-1);
\end{scope}
\end{tikzpicture}

*** 滞后校正示意图:					      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :BEAMER_envargs: <3->
     :END:
\begin{tikzpicture}[scale=0.7]
\coordinate (o) at (0,0);
\coordinate (ox) at (4.5,0);
\draw[->] (-1,0) -- (ox);
\draw[->] (0,-1.1) -- (0,1.5);
\draw (0,0.5) node[above left] {$L(\omega)$};
\draw (o) node[below left] {$o$};
%\draw [red,thick] plot coordinates {(0,0) (1,0) (2,-1)  (3,-1)};
\coordinate (c) at (3.5,-0.3);
\coordinate (c1) at ($(c) +(160:3)$);
\coordinate (d) at (3.5,0.2);
\coordinate (de) at ($(3.5,0.2)+(-40:1)$);
\coordinate (a) at ($(d) +(160:3)$);
\coordinate (a1) at ($(a) +(-40:3)$);
\coordinate (b) at (intersection of a--a1 and c--c1);
\coordinate (w1) at (intersection of d--de and o--ox);
\coordinate (w2) at (intersection of b--c and o--ox);
\draw[red] (a)++(160:0.5)--(d)--(de);
\draw[blue] (a)--(b)--(c)--+(-40:1);
\draw (w1) node[above right] {$\omega_c'$};
\draw (w2) node[below] {$\omega_c''$};

\begin{scope}[shift={(0,-3)}]
\draw[->] (-1,0) -- (4.5,0);
\draw[->] (0,-1.1) -- (0,0.5);
\draw (0,0.5) node[above left] {$\phi(\omega)$};
\draw [red,thick] plot [smooth] coordinates {(0,0) (0.3,-0.1) (0.6,-0.25) (1.1,-0.5) (2.5,-0.65) (3,-0.7) (3.7,-0.9) (3.9,-1)};
\draw[dashed,red] (0,-1) -- (4.5,-1);
\draw (0,-1) node[left] {$-180^\circ$};
\end{scope}
\end{tikzpicture}

** 滞后校正网络分析
 *  根据期望相角裕度 $\gamma''$ ,求解
     \begin{eqnarray*}
     \gamma'' & = &180^{\circ}+\phi(\omega_c'')+\phi_c(\omega_c'') 
     \end{eqnarray*}
 * <2->得到期望截止频率 $\omega_c''$ ,其中 $\phi_c(\omega_c'')$ 可取为 $-6^\circ$ .
 * <3->为了实现新的截止频率,需要:
     \begin{eqnarray*}
     20\lg b & = & L(\omega_c'') 
     \end{eqnarray*}
 * <4->为了减轻对相频特性的影响,需要:
     \begin{eqnarray*}
      \omega_c'' & = & \frac{10}{bT}
     \end{eqnarray*}
** 适用泛围
# * <2->未校正系统可以是不稳定系统,
 * 主要用于提高系统稳定程度
 * 期望截止频率小于未校正系统截止频率,即: $\omega_c''<\omega_c'$ 
** 设计步聚
设计步聚
 * 由 $e_{ss}$ 确定开环增益 $K$ 
 * 画未校正系统Bode图
 * <2->由设计指标确定 $\gamma''$ ,求解:  $\gamma''-180^{\circ} = \phi(\omega_c'')-6^{\circ}$ 确定 $\omega_c''$ 
 * <3->计算 $b,T$ , 
         \[20\lg b=L(\omega_c''),\frac{1}{bT}=0.1\omega_c''\]
* 滞后校正示例
** 滞后校正示例1
设单位负反馈系统 $G(s)=\frac{K}{s(s+1)(0.2s+1)}$ 设计串联校正装置,满足  $K_v=8, \gamma''\geq 40^{\circ}$ 

解:

   * <2->根据稳态性能指标得
      \begin{eqnarray*}
      K_v & = &8 \\
      K_v &= & K \\
       K &=& 8
      \end{eqnarray*}
      \begin{eqnarray*}
      L(\omega) & = & \begin{cases}20\lg\frac{8}{\omega} & \omega <1 \\
                                   20\lg\frac{8}{\omega^2} & 1\leq \omega < 5 \\
                                   20\lg\frac{8}{0.2\omega^3} &  \omega \geq 5 \\  \end{cases}\\
      \omega_c' &=& 2.8 \\
      \gamma' &=& -10^{\circ} \\
      \end{eqnarray*}

** 滞后校正示例1:参数求解
根据  $\gamma''$  计算  $\omega_c''$ 
\begin{eqnarray*}
180^{\circ}-90^{\circ}-\arctan\omega_c''-\arctan0.2\omega_c'' & = & 40^{\circ}+\epsilon\\
\epsilon &=& 6^{\circ} \\
\omega_c'' &\approx& 0.7 \\
L(\omega_c'') +20\lg b&=& 0 \\
b &=& 0.09 \\
\frac{1}{bT} &=& 0.1\omega_c''\\
T &=& 158.7 \\
\end{eqnarray*}

滞后校正网絡为:  $G_c=\frac{14.3s+1}{158.7s+1}$ 

** 滞后校正示例2
设单位负反馈系统  $G(s)=\frac{5}{s(s+1)(0.5s+1)}$  ,设计串联校正装置,使校正后系统满足 $\gamma''\geq 40^{\circ}, h''\geq 10dB$ 

  * <2->解:
      \begin{eqnarray*}
      L(\omega) & = & \begin{cases} 20\lg\frac{5}{\omega} & \omega <1\\
                                    20\lg\frac{5}{\omega^2} & 1<\omega<2 \\
                                    20\lg\frac{5}{0.5\omega^3} & \omega\geq 2 \end{cases}\\
      \omega_c' &=& 2.15 \\
      \gamma' &=& 180^{\circ}-90^{\circ}-\arctan\omega_c'-\arctan0.5\omega_c' \\
       &=& -22^{\circ} 
      \end{eqnarray*}

** 滞后校正示例2(续)选用滞后校正,根据  $\gamma''$  计算  $\omega_c''$ 

\begin{eqnarray*}
180^{\circ}+\phi(\omega_c'') & = & 40^{\circ}+\epsilon\\
\epsilon &=& 6^{\circ} \\
\omega_c'' &\approx& 0.5 \\
L(\omega_c'') +20\lg b &=& 0 \\
20\lg\frac{5}{\omega_c''} +20\lg b &=& 0\\
b &=& 0.1 \\
\frac{1}{bT} &=& 0.1\omega_c'' \\
T &=& 200
\end{eqnarray*}

** 滞后校正示例2(续)验证幅值裕度
\begin{align*}
\phi(\omega_x) &= -180^{\circ} \\
\angle\omega_x j(\omega_x j+1)(0.5\omega_x j+1) &=180^{\circ}\\
\angle(\omega_x j+1)(0.5\omega_x j+1) &=90^{\circ}\\
\angle(-0.5\omega_x^2+1+1.5\omega_x j) &=90^{\circ}\\
-0.5\omega_x^2+1 &=0 \\
\omega_x &=\sqrt{2}\\
L(\omega_x) &=-20\lg\frac{5}{\sqrt{2}\cdot\sqrt{2}\cdot 0.5\sqrt{2}} \\
&\approx -11\\
h'' &=11>10
\end{align*}
** 滞后校正示例2(续)另一种方式验证幅值裕度：
 *  当校正后的幅值裕度  $h''$ 难以计算时,可结合幅频特性验证。
     \begin{eqnarray*}
     L(\omega_x)+L_c(\omega_x) &=& -10 \\
     20\lg\frac{5b}{\omega_x^2} &=& -10, \qquad 1<\omega_x<2 \\
     \omega_x &\approx& 1.36 \\
     \phi(\omega_x) & = & -178^{\circ} \\
     \omega_x'' &>& \omega_x \\
     L(\omega_x'')+L_c(\omega_x'') &<& -10 \\
     h'' &>& 10dB
     \end{eqnarray*}
